Revit 2026 API

# Int Properties

---

The SpecTypeIdInt type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Integer | Integer, in discipline Common. |
|  | NumberOfPoles | Number of Poles, in discipline Electrical. |

#### Reference

SpecTypeIdInt Class

Autodesk.Revit.DB Namespace